---
kind: property
id: P:Autodesk.Revit.DB.ConnectorManager.Owner
source: html/606dbe85-2985-88c2-823e-f1e84d348bb5.htm
---
# Autodesk.Revit.DB.ConnectorManager.Owner Property

This property is used to retrieve the owner of the Connector Manager.

## Syntax (C#)
```csharp
public Element Owner { get; }
```